midimaster21b/MSP432_DriverLibrary/jedge_st7735.h
/*
 * jedge_st7735.h
 *
 *  Created on: Jun 27, 2018
 *      Author: Joshua Edgcombe
 */

#ifndef JEDGE_ST7735_H_
#define JEDGE_ST7735_H_

#include "msp.h"
#include "jedge_spi.h"

/*******************
 * Pin declarations
 *******************/
#define TFT_LIGHT_PORT P6
#define TFT_LIGHT_PIN  6
#define TFT_LIGHT_MASK 1 << TFT_LIGHT_PIN

#define TFT_DC_PORT P5
#define TFT_DC_PIN  2
#define TFT_DC_MASK 1 << TFT_DC_PIN

#define TFT_RESET_PORT P3
#define TFT_RESET_PIN  6
#define TFT_RESET_MASK 1 << TFT_RESET_PIN

#define TFT_SPI_MOSI_PORT P1
#define TFT_SPI_MOSI_PIN  6
#define TFT_SPI_MOSI_MASK 1 << TFT_SPI_MOSI_PIN

#define TFT_SPI_CS_PORT P5
#define TFT_SPI_CS_PIN  0
#define TFT_SPI_CS_MASK 1 << TFT_SPI_CS_PIN

#define TFT_SPI_CLK_PORT P1
#define TFT_SPI_CLK_PIN  5
#define TFT_SPI_CLK_MASK 1 << TFT_SPI_CLK_PIN

#define TFT_SPI_MISO_PORT P1
#define TFT_SPI_MISO_PIN  7
#define TFT_SPI_MISO_MASK 1 << TFT_SPI_MISO_PIN

/*************************************************
 * Command declarations: System function commands
 *************************************************/
// System function commands
#define ST7735_NOP        0x00 // No operation
#define ST7735_SWRESET    0x01 // Software reset
#define ST7735_RDDID      0x04 // Read display ID
#define ST7735_RDDST      0x09 // Read display status
#define ST7735_RDDPM      0x0A // Read display power
#define ST7735_RDD_MADCTL 0x0B // Read display
#define ST7735_RDD_COLMOD 0x0C // Read display pixel
#define ST7735_RDDIM      0x0D // Read display image
#define ST7735_RDDSM      0x0E // Read display signal
#define ST7735_SLPIN      0x10 // Sleep in & booster off?
#define ST7735_SLPOUT     0x11 // Sleep out & booster on?
#define ST7735_PTLON      0x12 // Partial mode on
#define ST7735_NORON      0x13 // Partial mode off (Normal)
#define ST7735_INVOFF     0x20 // Display inverion off
#define ST7735_INVON      0x21 // Display inverion on
#define ST7735_GAMSET     0x26 // Gamm curve select
#define ST7735_DISPOFF    0x28 // Display off
#define ST7735_DISPON     0x29 // Display on
#define ST7735_CASET      0x2A // Column address set
#define ST7735_RASET      0x2B // Row address set
#define ST7735_RAMWR      0x2C // Memory write
#define ST7735_RGBSET     0x2D // LUT for 4k, 65k, 262k color
#define ST7735_RAMRD      0x2E // Memory read
#define ST7735_PTLAR      0x30 // Partial start/end address set
#define ST7735_TEOFF      0x34 // Tearing effect line off
#define ST7735_TEON       0x35 // Tearing effect mode set & on
#define ST7735_MADCTL     0x36 // Memory data access control
#define ST7735_IDMOFF     0x38 // Idle mode off
#define ST7735_IDMON      0x39 // Idle mode on
#define ST7735_COLMOD     0x3A // Interface pixel format
#define ST7735_RDID1      0xDA // Read ID1
#define ST7735_RDID2      0xDB // Read ID2
#define ST7735_RDID3      0xDC // Read ID3

// System function argument definitions
// NOP: No operation (No params/args) (pg. 82)
// SWRESET: Software reset (No params/args) (pg. 83)

////////////////////////////////////////
// RDDID (pg. 84)
////////////////////////////////////////
// LCD module's manufacturer ID
#define ST7735_RDDID_ID1_MASK 0xFF

// LCD module module/driver version ID
#define ST7735_RDDID_ID2_MASK 0x7F

// LCD module module/driver ID
#define ST7735_RDDID_ID3_MASK 0xFF

////////////////////////////////////////
// RDDST: Read display status (pg. 85)
////////////////////////////////////////
// 1st parameter (none/dummy)
// 2nd parameter
// Booster voltage status
#define ST7735_RDDST_BSTON_OFS  7
#define ST7735_RDDST_BSTON_MASK (1 << ST7735_RDDST_BSTON_OFS)

// Row address order
#define ST7735_RDDST_MY_OFS  6
#define ST7735_RDDST_MY_MASK (1 << ST7735_RDDST_MY_OFS)

// Column address order
#define ST7735_RDDST_MX_OFS  5
#define ST7735_RDDST_MX_MASK (1 << ST7735_RDDST_MX_OFS)

// Row/Column exchange
#define ST7735_RDDST_MV_OFS  4
#define ST7735_RDDST_MV_MASK (1 << ST7735_RDDST_MV_OFS)

// Scan address order
#define ST7735_RDDST_ML_OFS  3
#define ST7735_RDDST_ML_MASK (1 << ST7735_RDDST_ML_OFS)

// RGB/BGR order
#define ST7735_RDDST_RGB_OFS  2
#define ST7735_RDDST_RGB_MASK (1 << ST7735_RDDST_RGB_OFS)

// Horizontal order
#define ST7735_RDDST_MH_OFS  1
#define ST7735_RDDST_MH_MASK (1 << ST7735_RDDST_MH_OFS)

// 3rd paramter
// Interface color pixel format definition (InterFace Pixel Format)
#define ST7735_RDDST_IFPF_OFS  4
#define ST7735_RDDST_IFPF_MASK (7 << ST7735_RDDST_IFPF_OFS)
#define ST7735_RDDST_IFPF_12_BIT (3 << ST7735_RDDST_IFPF_OFS)
#define ST7735_RDDST_IFPF_16_BIT (5 << ST7735_RDDST_IFPF_OFS)
#define ST7735_RDDST_IFPF_18_BIT (6 << ST7735_RDDST_IFPF_OFS)

// Idle mode on/off
#define ST7735_RDDST_IDMON_OFS  3
#define ST7735_RDDST_IDMON_MASK (1 << ST7735_RDDST_IDMON_OFS)

// Partial mode on/off
#define ST7735_RDDST_PTLON_OFS  2
#define ST7735_RDDST_PTLON_MASK (1 << ST7735_RDDST_PTLON_OFS)

// Sleep in/out
#define ST7735_RDDST_SLPOUT_OFS  1
#define ST7735_RDDST_SLPOUT_MASK (1 << ST7735_RDDST_SLPOUT_OFS)

// Normal mode on/off
#define ST7735_RDDST_NORON_OFS  0
#define ST7735_RDDST_NORON_MASK (1 << ST7735_RDDST_NORON_OFS)

// 4th Parameter
// Vertical scrolling status
#define ST7735_RDDST_ST15_OFS  7
#define ST7735_RDDST_ST15_MASK (1 << ST7735_RDDST_ST15_OFS)

// Vertical scrolling status
#define ST7735_RDDST_INVON_OFS  5
#define ST7735_RDDST_INVON_MASK (1 << ST7735_RDDST_INVON_OFS)

// Display on/off
#define ST7735_RDDST_DISON_OFS  2
#define ST7735_RDDST_DISON_MASK (1 << ST7735_RDDST_DISON_OFS)

// Tearing effect line on/off
#define ST7735_RDDST_TEON_OFS  1
#define ST7735_RDDST_TEON_MASK (1 << ST7735_RDDST_TEON_OFS)

// Gamma curve selection (bit 2)
#define ST7735_RDDST_GCSEL2_OFS  0
#define ST7735_RDDST_GCSEL2_MASK (1 << ST7735_RDDST_GCSEL2_OFS)

// 5th Paramter
// Gamma curve selection (bit 1)
#define ST7735_RDDST_GCSEL1_OFS  7
#define ST7735_RDDST_GCSEL1_MASK (1 << ST7735_RDDST_GCSEL1_OFS)

// Gamma curve selection (bit 0)
#define ST7735_RDDST_GCSEL0_OFS  6
#define ST7735_RDDST_GCSEL0_MASK (1 << ST7735_RDDST_GCSEL0_OFS)

// Tearing effect line mode
#define ST7735_RDDST_TEM_OFS  5
#define ST7735_RDDST_TEM_MASK (1 << ST7735_RDDST_TEM_OFS)

///////////////////////////////////////////
// RDDPM: Read display power mode (pg. 87)
///////////////////////////////////////////
// 1st parameter (none/dummy)
// 2nd parameter
// Booster voltage status
#define ST7735_RDDPM_BSTON_OFS  7
#define ST7735_RDDPM_BSTON_MASK (1 << ST7735_RDDPM_BSTON_OFS)

// Idle mode on/off
#define ST7735_RDDPM_IDMON_OFS  6
#define ST7735_RDDPM_IDMON_MASK (1 << ST7735_RDDPM_IDMON_OFS)

// Partial mode on/off
#define ST7735_RDDPM_PTLON_OFS  5
#define ST7735_RDDPM_PTLON_MASK (1 << ST7735_RDDPM_PTLON_OFS)

// Sleep in/out
#define ST7735_RDDPM_SLPON_OFS  4
#define ST7735_RDDPM_SLPON_MASK (1 << ST7735_RDDPM_SLPON_OFS)

// Display normal mode on/off
#define ST7735_RDDPM_NORON_OFS  3
#define ST7735_RDDPM_NORON_MASK (1 << ST7735_RDDPM_NORON_OFS)

