midimaster21b/MSP432_DriverLibrary/jedge_st7735.h
// Display on/off
#define ST7735_RDDPM_DISON_OFS  2
#define ST7735_RDDPM_DISON_MASK (1 << ST7735_RDDPM_DISON_OFS)

///////////////////////////////////////////
// RDDMADCTL: Read display MADCTL (pg. 88)
///////////////////////////////////////////
// 1st parameter (none/dummy)
// 2nd parameter
// Column address order
#define ST7735_RDDMADCTL_MX_OFS  7
#define ST7735_RDDMADCTL_MX_MASK (1 << ST7735_RDDMADCTL_MX_OFS)

// Row address order
#define ST7735_RDDMADCTL_MY_OFS  6
#define ST7735_RDDMADCTL_MY_MASK (1 << ST7735_RDDMADCTL_MY_OFS)

// Row/column order
#define ST7735_RDDMADCTL_MV_OFS  5
#define ST7735_RDDMADCTL_MV_MASK (1 << ST7735_RDDMADCTL_MV_OFS)

// Vertical refresh order
#define ST7735_RDDMADCTL_ML_OFS  4
#define ST7735_RDDMADCTL_ML_MASK (1 << ST7735_RDDMADCTL_ML_OFS)

// RGB/BGR order
#define ST7735_RDDMADCTL_RGB_OFS  3
#define ST7735_RDDMADCTL_RGB_MASK (1 << ST7735_RDDMADCTL_RGB_OFS)

// Horizontal refresh order
#define ST7735_RDDMADCTL_MH_OFS  2
#define ST7735_RDDMADCTL_MH_MASK (1 << ST7735_RDDMADCTL_MH_OFS)

/////////////////////////////////////////////////
// RDDCOLMOD: Read display pixel format (pg. 89)
/////////////////////////////////////////////////
// 1st parameter (none/dummy)
// 2nd parameter
// Interface pixel format
#define ST7735_RDDCOLMOD_IFPF_OFS    0
#define ST7735_RDDCOLMOD_IFPF_MASK   (7 << ST7735_RDDCOLMOD_IFPF_OFS)
#define ST7735_RDDCOLMOD_IFPF_12_BIT (3 << ST7735_RDDCOLMOD_IFPF_OFS)
#define ST7735_RDDCOLMOD_IFPF_16_BIT (5 << ST7735_RDDCOLMOD_IFPF_OFS)
#define ST7735_RDDCOLMOD_IFPF_18_BIT (6 << ST7735_RDDCOLMOD_IFPF_OFS)
#define ST7735_RDDCOLMOD_IFPF_NA     (7 << ST7735_RDDCOLMOD_IFPF_OFS)

///////////////////////////////////////////
// RDDIM: Read display image mode (pg. 90)
///////////////////////////////////////////
// 1st parameter (none/dummy)
// 2nd parameter
// Inversion on/off
#define ST7735_RDDIM_INVON_OFS  5
#define ST7735_RDDIM_INVON_MASK (1 << ST7735_RDDIM_INVON_OFS)

// Gamma curve selection
#define ST7735_RDDIM_GCS_OFS  0
#define ST7735_RDDIM_GCS_MASK (7 << ST7735_RDDIM_GCS_OFS)
#define ST7735_RDDIM_GCS_GC0 (0 << ST7735_RDDIM_GCS_OFS)
#define ST7735_RDDIM_GCS_GC1 (1 << ST7735_RDDIM_GCS_OFS)
#define ST7735_RDDIM_GCS_GC2 (2 << ST7735_RDDIM_GCS_OFS)
#define ST7735_RDDIM_GCS_GC3 (3 << ST7735_RDDIM_GCS_OFS)

////////////////////////////////////////////
// RDDSM: Read display signal mode (pg. 91)
////////////////////////////////////////////
// 1st parameter (none/dummy)
// 2nd parameter
// Tearing effect line on/off
#define ST7735_RDDSM_TEON_OFS  7
#define ST7735_RDDSM_TEON_MASK (1 << ST7735_RDDSM_TEON_OFS)

// Tearing effect line mode
#define ST7735_RDDSM_TEM_OFS  6
#define ST7735_RDDSM_TEM_MASK (1 << ST7735_RDDSM_TEM_OFS)

////////////////////////////////////////////////////////////
// SLPIN: Sleep in (No params/args) (pg. 93)
// SLPOUT: Sleep out (No params/args) (pg. 94)
// PTLON: Partial display mode on (No params/args) (pg. 95)
// NORON: Normal display mode on (No params/args) (pg. 96)
// INVOFF: Display inversion off (No params/args) (pg. 97)
// INVON: Display inversion on (No params/args) (pg. 98)
////////////////////////////////////////////////////////////

///////////////////////////////////////////
// GAMSET: Gamma set (pg. 99)
///////////////////////////////////////////
// 1st parameter
// Gamma curve selection (GS=0, GS=1?)
#define ST7735_GAMSET_GC_OFS  0
#define ST7735_GAMSET_GC_MASK (0x0F << ST7735_RDDIM_INVON_OFS)
#define ST7735_GAMSET_GC0     (0x01 << ST7735_RDDIM_INVON_OFS)
#define ST7735_GAMSET_GC1     (0x02 << ST7735_RDDIM_INVON_OFS)
#define ST7735_GAMSET_GC2     (0x04 << ST7735_RDDIM_INVON_OFS)
#define ST7735_GAMSET_GC3     (0x08 << ST7735_RDDIM_INVON_OFS)

////////////////////////////////////////////////////////////////////////////////
// DISPOFF: Display off (No params/args) (pg. 100)
// DISPON: Display on (No params/args) (pg. 101)
// CASET: Column address set (Param/arg def's not necessary) (pg. 102)
// RASET: Row address set (Param/arg def's not necessary) (pg. 104)
// RAMWR: Memory write (Param/arg def's not necessary) (pg. 106)
// RGBSET: Color setting for 4k, 65k, and 262k (Param/arg def's not necessary) (pg. 107)
// RAMRD: Memory read (Param/arg def's not necessary) (pg. 108)
// PTLAR: Partial area (Param/arg def's not necessary) (pg. 109)
// TEOFF: Tearing effect line off (No params/args) (pg. 111)
////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////
// TEON: Tearing effect line on (pg. 112)
///////////////////////////////////////////
// 1st parameter
// When TEM ='0': The Tearing Effect output line consists of V-Blanking information only
#define ST7735_TEON_TEM_OFS  0
#define ST7735_TEON_TEM_MASK  (1 << ST7735_TEON_TEM_OFS)

////////////////////////////////////////////////
// MADCTL: Memory data access control (pg. 113)
////////////////////////////////////////////////
// 1st parameter
// Row address order
#define ST7735_MADCTL_MY_OFS  7
#define ST7735_MADCTL_MY_MASK (1 << ST7735_MADCTL_MY_OFS)

// Column address order
#define ST7735_MADCTL_MX_OFS  6
#define ST7735_MADCTL_MX_MASK (1 << ST7735_MADCTL_MX_OFS)

// Row/Column exchange
#define ST7735_MADCTL_MV_OFS  5
#define ST7735_MADCTL_MV_MASK (1 << ST7735_MADCTL_MV_OFS)

// Vertical refresh order
#define ST7735_MADCTL_ML_OFS  4
#define ST7735_MADCTL_ML_MASK (1 << ST7735_MADCTL_ML_OFS)

// RGB-BGR Order
#define ST7735_MADCTL_RGB_OFS  3
#define ST7735_MADCTL_RGB_MASK (1 << ST7735_MADCTL_RGB_OFS)

// Horizontal refresh order
#define ST7735_MADCTL_MH_OFS  2
#define ST7735_MADCTL_MH_MASK (1 << ST7735_MADCTL_MH_OFS)

////////////////////////////////////////////////////
// IDMOFF: Idle mode off (No params/args) (pg. 115)
// IDMON: Idle mode on (No params/args) (pg. 116)
////////////////////////////////////////////////////

////////////////////////////////////////////
// COLMOD: Interface pixel format (pg. 118)
////////////////////////////////////////////
// 1st parameter
// Interface pixel format
#define ST7735_COLMOD_IFPF_OFS  0
#define ST7735_COLMOD_IFPF_MASK (7 << ST7735_COLMOD_IFPF_OFS)

#define ST7735_COLMOD_IFPF_12_BIT (3 << ST7735_COLMOD_IFPF_OFS)
#define ST7735_COLMOD_IFPF_16_BIT (5 << ST7735_COLMOD_IFPF_OFS)
#define ST7735_COLMOD_IFPF_18_BIT (6 << ST7735_COLMOD_IFPF_OFS)
#define ST7735_COLMOD_IFPF_NA     (7 << ST7735_COLMOD_IFPF_OFS)

//////////////////////////////////////////////////////////////////////////////////////////////////
// RDID1: Read ID1 value (LCD module's manufacturer ID) (Param/arg def's not necessary) (pg. 119)
// RDID2: Read ID2 value (LCD module/driver version ID) (Param/arg def's not necessary) (pg. 120)
// RDID3: Read ID3 value (LCD module/driver ID) (Param/arg def's not necessary) (pg. 121)
//////////////////////////////////////////////////////////////////////////////////////////////////

/************************************************
 * Command declarations: Panel function commands
 ************************************************/
#define ST7735_FRMCTR1    0xB1 // In normal mode (Full colors)
#define ST7735_FRMCTR2    0xB2 // In idle mode (8-colors)
#define ST7735_FRMCTR3    0xB3 // In partial mode + full colors
#define ST7735_INVCTR     0xB4 // Display inversion control
#define ST7735_PWCTR1     0xC0 // Power control setting
#define ST7735_PWCTR2     0xC1 // Power control setting
#define ST7735_PWCTR3     0xC2 // Power control setting (In normal mode (Full colors))
#define ST7735_PWCTR4     0xC3 // Power control setting (In idle mode (8-colors))
#define ST7735_PWCTR5     0xC4 // Power control setting (In partial mode + full colors)
#define ST7735_VMCTR1     0xC5 // VCOM control 1
#define ST7735_VMOFCTR    0xC7 // Set VCOM offset control
#define ST7735_WRID2      0xD1 // Set LCM version code
#define ST7735_WRID3      0xD2 // Set customer project code
#define ST7735_NVCTR1     0xD9 // NVM control status
#define ST7735_NVCTR2     0xDE // NVM read command
#define ST7735_NVCTR3     0xDF // NVM write command
#define ST7735_GMCTRP1    0xE0 // Positive gamma correction characteristics
#define ST7735_GMCTRN1    0xE1 // Negative gamma correction characteristics

// Panel function argument definitions

//////////////////////////////////////////////////////////////////////
// FRMCTR1: Frame rate control (In normal mode/full colors) (pg. 126)
//////////////////////////////////////////////////////////////////////
/**********************************************************************
 * Description: Set the frame frequency of the full colors normal mode.
 * Frame_rate= fosc / ((RTNA x 2 + 40) x (LINE + FPA + BPA))
 * fosc = 625kHz
 **********************************************************************/
// 1st parameter
// Set one line period A(Normal mode)
#define ST7735_FRMCTR1_RTNA_OFS  0
#define ST7735_FRMCTR1_RTNA_MASK (0x0F << ST7735_FRMCTR1_RTNA_OFS)

// 2nd parameter
// Front porch A(Normal mode)
#define ST7735_FRMCTR1_FPA_OFS  0
#define ST7735_FRMCTR1_FPA_MASK (0x3F << ST7735_FRMCTR1_FPA_OFS)

// 3rd parameter
// Back porch A(Normal mode)
#define ST7735_FRMCTR1_BPA_OFS  0
#define ST7735_FRMCTR1_BPA_MASK (0x3F << ST7735_FRMCTR1_BPA_OFS)

/////////////////////////////////////////////////////////////////
// FRMCTR2: Frame rate control (In idle mode/8 colors) (pg. 127)
/////////////////////////////////////////////////////////////////
/**********************************************************************
 * Description: Set the frame frequency of the idle mode.
 * Frame_rate= fosc / ((RTNB x 2 + 40) x (LINE + FPB + BPB))
 * fosc = 625kHz
 **********************************************************************/
// 1st parameter
// Set one line period B(Idle mode)
#define ST7735_FRMCTR1_RTNB_OFS  0
#define ST7735_FRMCTR1_RTNB_MASK (0x0F << ST7735_FRMCTR1_RTNB_OFS)

// 2nd parameter
// Front porch B(Idle mode)
#define ST7735_FRMCTR1_FPB_OFS  0
#define ST7735_FRMCTR1_FPB_MASK (0x3F << ST7735_FRMCTR1_FPB_OFS)

// 3rd parameter
// Back porch B(Idle mode)
#define ST7735_FRMCTR1_BPB_OFS  0
#define ST7735_FRMCTR1_BPB_MASK (0x3F << ST7735_FRMCTR1_BPB_OFS)

///////////////////////////////////////////////////////////////////////
// FRMCTR3: Frame rate control (In partial mode/full colors) (pg. 128)
///////////////////////////////////////////////////////////////////////
/**********************************************************************
 * Description: Set the frame frequency of partial mode with full colors.
 * Frame_rate= fosc / ((RTNC x 2 + 40) x (LINE + FPC + BPC))
 * fosc = 625kHz
 * NOTES:
 *  - The 1st through 3rd parameters are used in dot inversion mode.
 *  - The 4th through 6th parameters are used in line inversion mode.
 **********************************************************************/
// 1st parameter
// Set one line period C(Partial mode)
#define ST7735_FRMCTR1_RTNC_OFS  0
#define ST7735_FRMCTR1_RTNC_MASK (0x0F << ST7735_FRMCTR1_RTNC_OFS)

// 2nd parameter
// Front porch C(Partial mode)
#define ST7735_FRMCTR1_FPC_OFS  0
#define ST7735_FRMCTR1_FPC_MASK (0x3F << ST7735_FRMCTR1_FPC_OFS)

// 3rd parameter
// Back porch C(Partial mode)
#define ST7735_FRMCTR1_BPC_OFS  0
#define ST7735_FRMCTR1_BPC_MASK (0x3F << ST7735_FRMCTR1_BPC_OFS)

