midimaster21b/MSP432_DriverLibrary/jedge_st7735.h
// 4th parameter
// Set one line period D(Partial mode)
#define ST7735_FRMCTR1_RTND_OFS  0
#define ST7735_FRMCTR1_RTND_MASK (0x0F << ST7735_FRMCTR1_RTND_OFS)

// 5th parameter
// Front porch D(Partial mode)
#define ST7735_FRMCTR1_FPD_OFS  0
#define ST7735_FRMCTR1_FPD_MASK (0x3F << ST7735_FRMCTR1_FPD_OFS)

// 6th parameter
// Back porch D(Partial mode)
#define ST7735_FRMCTR1_BPD_OFS  0
#define ST7735_FRMCTR1_BPD_MASK (0x3F << ST7735_FRMCTR1_BPD_OFS)

///////////////////////////////////////////////
// INVCTR: Display inversion control (pg. 129)
///////////////////////////////////////////////
// 1st parameter
// Inversion setting in full color normal mode (Normal mode on)
#define ST7735_INVCTR_NLA_OFS  2
#define ST7735_INVCTR_NLA_MASK (1 << ST7735_INVCTR_NLA_OFS)

// Inversion setting in idle mode (Idle mode on)
#define ST7735_INVCTR_NLB_OFS  1
#define ST7735_INVCTR_NLB_MASK (1 << ST7735_INVCTR_NLB_OFS)

// Inversion setting in full color partial mode (Partial mode on / Idle mode off)
#define ST7735_INVCTR_NLC_OFS  0
#define ST7735_INVCTR_NLC_MASK (1 << ST7735_INVCTR_NLC_OFS)

/////////////////////////////////////
// PWCTR1: Power control 1 (pg. 130)
/////////////////////////////////////
// 1st parameter
// AVDD Voltage (Voltages 4.5V to 5.1V available)
#define ST7735_PWCTR1_AVDD_OFS  5
#define ST7735_PWCTR1_AVDD_MASK (0x07 << ST7735_PWCTR1_AVDD_OFS)

#define ST7735_PWCTR1_AVDD_4_5V (0x00 << ST7735_PWCTR1_AVDD_OFS)
#define ST7735_PWCTR1_AVDD_4_6V (0x01 << ST7735_PWCTR1_AVDD_OFS)
#define ST7735_PWCTR1_AVDD_4_7V (0x02 << ST7735_PWCTR1_AVDD_OFS)
#define ST7735_PWCTR1_AVDD_4_8V (0x03 << ST7735_PWCTR1_AVDD_OFS)
#define ST7735_PWCTR1_AVDD_4_9V (0x04 << ST7735_PWCTR1_AVDD_OFS)
#define ST7735_PWCTR1_AVDD_5_0V (0x05 << ST7735_PWCTR1_AVDD_OFS)
#define ST7735_PWCTR1_AVDD_5_1V (0x06 << ST7735_PWCTR1_AVDD_OFS)

// VRHP: GVDD Voltages (Voltages 4.7V to 3.15V)
#define ST7735_PWCTR1_VRHP_OFS  0
#define ST7735_PWCTR1_VRHP_MASK (0x1F << ST7735_PWCTR1_VRHP_OFS)

#define ST7735_PWCTR1_VRHP_4_7  (0x00 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_4_65 (0x01 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_4_6  (0x02 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_4_55 (0x03 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_4_5  (0x04 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_4_45 (0x05 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_4_4  (0x06 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_4_35 (0x07 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_4_3  (0x08 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_4_25 (0x09 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_4_2  (0x0A << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_4_15 (0x0B << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_4_1  (0x0C << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_4_05 (0x0D << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_4_0  (0x0E << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_95 (0x0F << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_9  (0x10 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_85 (0x11 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_8  (0x12 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_75 (0x13 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_7  (0x14 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_65 (0x15 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_6  (0x16 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_55 (0x17 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_5  (0x18 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_45 (0x19 << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_4  (0x1A << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_35 (0x1B << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_3  (0x1C << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_25 (0x1D << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_2  (0x1E << ST7735_PWCTR1_VRHP_OFS)
#define ST7735_PWCTR1_VRHP_3_15 (0x1F << ST7735_PWCTR1_VRHP_OFS)

// 2nd parameter
// VRHN: GVCL Voltages (Voltages -4.7V to -3.15V available)
#define ST7735_PWCTR1_VRHN_OFS  0
#define ST7735_PWCTR1_VRHN_MASK (0x1F << ST7735_PWCTR1_VRHN_OFS)

#define ST7735_PWCTR1_VRHN_4_7  (0x00 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_4_65 (0x01 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_4_6  (0x02 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_4_55 (0x03 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_4_5  (0x04 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_4_45 (0x05 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_4_4  (0x06 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_4_35 (0x07 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_4_3  (0x08 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_4_25 (0x09 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_4_2  (0x0A << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_4_15 (0x0B << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_4_1  (0x0C << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_4_05 (0x0D << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_4_0  (0x0E << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_95 (0x0F << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_9  (0x10 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_85 (0x11 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_8  (0x12 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_75 (0x13 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_7  (0x14 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_65 (0x15 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_6  (0x16 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_55 (0x17 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_5  (0x18 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_45 (0x19 << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_4  (0x1A << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_35 (0x1B << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_3  (0x1C << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_25 (0x1D << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_2  (0x1E << ST7735_PWCTR1_VRHN_OFS)
#define ST7735_PWCTR1_VRHN_3_15 (0x1F << ST7735_PWCTR1_VRHN_OFS)

// 3rd parameter
// Mode: ...? Not sure...
#define ST7735_PWCTR1_MODE_OFS  6
#define ST7735_PWCTR1_MODE_MASK (0x03 << ST7735_PWCTR1_MODE_OFS)

#define ST7735_PWCTR1_MODE_2X     (0x00 << ST7735_PWCTR1_MODE_OFS)
#define ST7735_PWCTR1_MODE_3X     (0x01 << ST7735_PWCTR1_MODE_OFS)
#define ST7735_PWCTR1_MODE_AUTO   (0x02 << ST7735_PWCTR1_MODE_OFS)
#define ST7735_PWCTR1_MODE_3X_2   (0x03 << ST7735_PWCTR1_MODE_OFS)


