midimaster21b/MSP432_DriverLibrary/jedge_st7735.h
/////////////////////////////////////
// PWCTR2: Power control 2 (pg. 132)
/////////////////////////////////////
// 1st parameter
// VGH25: Set the VGH supply level...
#define ST7735_PWCTR2_VGH25_OFS  6
#define ST7735_PWCTR2_VGH25_MASK (0x03 << ST7735_PWCTR2_VGH25_OFS)

#define ST7735_PWCTR2_VGH25_2_1  (0x00 << ST7735_PWCTR2_VGH25_OFS)
#define ST7735_PWCTR2_VGH25_2_2  (0x01 << ST7735_PWCTR2_VGH25_OFS)
#define ST7735_PWCTR2_VGH25_2_3  (0x02 << ST7735_PWCTR2_VGH25_OFS)
#define ST7735_PWCTR2_VGH25_2_4  (0x03 << ST7735_PWCTR2_VGH25_OFS)

// VGLSEL: Set the VGL supply level...
// Values include -7.5V, -10V, -12.5V, and -13V
#define ST7735_PWCTR2_VGLSEL_OFS  2
#define ST7735_PWCTR2_VGLSEL_MASK (0x03 << ST7735_PWCTR2_VGLSEL_OFS)

#define ST7735_PWCTR2_VGLSEL_7_5  (0x00 << ST7735_PWCTR2_VGLSEL_OFS)
#define ST7735_PWCTR2_VGLSEL_10   (0x01 << ST7735_PWCTR2_VGLSEL_OFS)
#define ST7735_PWCTR2_VGLSEL_12_5 (0x02 << ST7735_PWCTR2_VGLSEL_OFS)
#define ST7735_PWCTR2_VGLSEL_13   (0x03 << ST7735_PWCTR2_VGLSEL_OFS)

// VGHBT: Selects equation used for supply levels
#define ST7735_PWCTR2_VGHBT_OFS  2
#define ST7735_PWCTR2_VGHBT_MASK (0x03 << ST7735_PWCTR2_VGHBT_OFS)

#define ST7735_PWCTR2_VGHBT_EQ_0 (0x00 << ST7735_PWCTR2_VGHBT_OFS) // 2 * AVDD + VGH25
#define ST7735_PWCTR2_VGHBT_EQ_1 (0x01 << ST7735_PWCTR2_VGHBT_OFS) // 3 * AVDD
#define ST7735_PWCTR2_VGHBT_EQ_2 (0x02 << ST7735_PWCTR2_VGHBT_OFS) // 3 * AVDD + VGH25

/////////////////////////////////////
// PWCTR3: Power control 3 (pg. 134)
/////////////////////////////////////
// 1st parameter
// DCA[9:8]: Set the booster circuit step-up cycle in normal mode/full color
#define ST7735_PWCTR3_DCA_98_OFS  6
#define ST7735_PWCTR3_DCA_98_MASK (0x03 << ST7735_PWCTR3_DCA_98_OFS)

#define ST7735_PWCTR3_DCA_98_DIV_1   (0x00 << ST7735_PWCTR3_DCA_98_OFS)
#define ST7735_PWCTR3_DCA_98_DIV_1_5 (0x01 << ST7735_PWCTR3_DCA_98_OFS)
#define ST7735_PWCTR3_DCA_98_DIV_2   (0x02 << ST7735_PWCTR3_DCA_98_OFS)
#define ST7735_PWCTR3_DCA_98_DIV_4   (0x03 << ST7735_PWCTR3_DCA_98_OFS)

// SAPA: Adjust the amount of fixed current from the fixed current source in the operational amplifier for the source driver.
#define ST7735_PWCTR3_SAPA_OFS  3
#define ST7735_PWCTR3_SAPA_MASK (0x07 << ST7735_PWCTR3_SAPA_OFS)

#define ST7735_PWCTR3_SAPA_STOP        (0x00 << ST7735_PWCTR3_SAPA_OFS)
#define ST7735_PWCTR3_SAPA_SMALL       (0x01 << ST7735_PWCTR3_SAPA_OFS)
#define ST7735_PWCTR3_SAPA_MEDIUM_LOW  (0x02 << ST7735_PWCTR3_SAPA_OFS)
#define ST7735_PWCTR3_SAPA_MEDIUM      (0x03 << ST7735_PWCTR3_SAPA_OFS)
#define ST7735_PWCTR3_SAPA_MEDIUM_HIGH (0x04 << ST7735_PWCTR3_SAPA_OFS)
#define ST7735_PWCTR3_SAPA_LARGE       (0x05 << ST7735_PWCTR3_SAPA_OFS)

// APA: Adjust the amount of fixed current from the fixed current source in the operational amplifier for the source driver.
#define ST7735_PWCTR3_APA_OFS  0
#define ST7735_PWCTR3_APA_MASK (0x07 << ST7735_PWCTR3_APA_OFS)

#define ST7735_PWCTR3_APA_STOP        (0x00 << ST7735_PWCTR3_APA_OFS)
#define ST7735_PWCTR3_APA_SMALL       (0x01 << ST7735_PWCTR3_APA_OFS)
#define ST7735_PWCTR3_APA_MEDIUM_LOW  (0x02 << ST7735_PWCTR3_APA_OFS)
#define ST7735_PWCTR3_APA_MEDIUM      (0x03 << ST7735_PWCTR3_APA_OFS)
#define ST7735_PWCTR3_APA_MEDIUM_HIGH (0x04 << ST7735_PWCTR3_APA_OFS)
#define ST7735_PWCTR3_APA_LARGE       (0x05 << ST7735_PWCTR3_APA_OFS)

// 2nd parameter
// DCA[7:6]: Set the booster circuit step-up cycle in normal mode/full color
#define ST7735_PWCTR3_DCA_76_OFS  6
#define ST7735_PWCTR3_DCA_76_MASK (0x03 << ST7735_PWCTR3_DCA_76_OFS)

#define ST7735_PWCTR3_DCA_76_DIV_1   (0x00 << ST7735_PWCTR3_DCA_76_OFS)
#define ST7735_PWCTR3_DCA_76_DIV_1_5 (0x01 << ST7735_PWCTR3_DCA_76_OFS)
#define ST7735_PWCTR3_DCA_76_DIV_2   (0x02 << ST7735_PWCTR3_DCA_76_OFS)
#define ST7735_PWCTR3_DCA_76_DIV_4   (0x03 << ST7735_PWCTR3_DCA_76_OFS)

// DCA[5:4]: Set the booster circuit step-up cycle in normal mode/full color
#define ST7735_PWCTR3_DCA_54_OFS  4
#define ST7735_PWCTR3_DCA_54_MASK (0x03 << ST7735_PWCTR3_DCA_54_OFS)

#define ST7735_PWCTR3_DCA_54_DIV_1   (0x00 << ST7735_PWCTR3_DCA_54_OFS)
#define ST7735_PWCTR3_DCA_54_DIV_1_5 (0x01 << ST7735_PWCTR3_DCA_54_OFS)
#define ST7735_PWCTR3_DCA_54_DIV_2   (0x02 << ST7735_PWCTR3_DCA_54_OFS)
#define ST7735_PWCTR3_DCA_54_DIV_4   (0x03 << ST7735_PWCTR3_DCA_54_OFS)

// DCA[3:2]: Set the booster circuit step-up cycle in normal mode/full color
#define ST7735_PWCTR3_DCA_32_OFS  2
#define ST7735_PWCTR3_DCA_32_MASK (0x03 << ST7735_PWCTR3_DCA_32_OFS)

#define ST7735_PWCTR3_DCA_32_DIV_1   (0x00 << ST7735_PWCTR3_DCA_32_OFS)
#define ST7735_PWCTR3_DCA_32_DIV_1_5 (0x01 << ST7735_PWCTR3_DCA_32_OFS)
#define ST7735_PWCTR3_DCA_32_DIV_2   (0x02 << ST7735_PWCTR3_DCA_32_OFS)
#define ST7735_PWCTR3_DCA_32_DIV_4   (0x03 << ST7735_PWCTR3_DCA_32_OFS)

// DCA[1:0]: Set the booster circuit step-up cycle in normal mode/full color
#define ST7735_PWCTR3_DCA_10_OFS  0
#define ST7735_PWCTR3_DCA_10_MASK (0x03 << ST7735_PWCTR3_DCA_10_OFS)

#define ST7735_PWCTR3_DCA_10_DIV_1   (0x00 << ST7735_PWCTR3_DCA_10_OFS)
#define ST7735_PWCTR3_DCA_10_DIV_1_5 (0x01 << ST7735_PWCTR3_DCA_10_OFS)
#define ST7735_PWCTR3_DCA_10_DIV_2   (0x02 << ST7735_PWCTR3_DCA_10_OFS)
#define ST7735_PWCTR3_DCA_10_DIV_4   (0x03 << ST7735_PWCTR3_DCA_10_OFS)

///////////////////////////////////////////
// PWCTR4: Power control 4 (pg. 136)
///////////////////////////////////////////
// 1st parameter
// DCB[9:8]: Set the booster circuit step-up cycle in idle mode/8 color
#define ST7735_PWCTR4_DCB_98_OFS  6
#define ST7735_PWCTR4_DCB_98_MASK (0x03 << ST7735_PWCTR4_DCB_98_OFS)

#define ST7735_PWCTR4_DCB_98_DIV_1   (0x00 << ST7735_PWCTR4_DCB_98_OFS)
#define ST7735_PWCTR4_DCB_98_DIV_1_5 (0x01 << ST7735_PWCTR4_DCB_98_OFS)
#define ST7735_PWCTR4_DCB_98_DIV_2   (0x02 << ST7735_PWCTR4_DCB_98_OFS)
#define ST7735_PWCTR4_DCB_98_DIV_4   (0x03 << ST7735_PWCTR4_DCB_98_OFS)

// SAPB: Adjust the amount of fixed current from the fixed current source in the operational amplifier for the source driver.
#define ST7735_PWCTR4_SAPB_OFS  3
#define ST7735_PWCTR4_SAPB_MASK (0x07 << ST7735_PWCTR4_SAPB_OFS)

#define ST7735_PWCTR4_SAPB_STOP        (0x00 << ST7735_PWCTR4_SAPB_OFS)
#define ST7735_PWCTR4_SAPB_SMALL       (0x01 << ST7735_PWCTR4_SAPB_OFS)
#define ST7735_PWCTR4_SAPB_MEDIUM_LOW  (0x02 << ST7735_PWCTR4_SAPB_OFS)
#define ST7735_PWCTR4_SAPB_MEDIUM      (0x03 << ST7735_PWCTR4_SAPB_OFS)
#define ST7735_PWCTR4_SAPB_MEDIUM_HIGH (0x04 << ST7735_PWCTR4_SAPB_OFS)
#define ST7735_PWCTR4_SAPB_LARGE       (0x05 << ST7735_PWCTR4_SAPB_OFS)

// APB: Adjust the amount of fixed current from the fixed current source in the operational amplifier for the source driver.
#define ST7735_PWCTR4_APB_OFS  0
#define ST7735_PWCTR4_APB_MASK (0x07 << ST7735_PWCTR4_APB_OFS)

