midimaster21b/MSP432_DriverLibrary/jedge_st7735.h
#define ST7735_PWCTR4_APB_STOP        (0x00 << ST7735_PWCTR4_APB_OFS)
#define ST7735_PWCTR4_APB_SMALL       (0x01 << ST7735_PWCTR4_APB_OFS)
#define ST7735_PWCTR4_APB_MEDIUM_LOW  (0x02 << ST7735_PWCTR4_APB_OFS)
#define ST7735_PWCTR4_APB_MEDIUM      (0x03 << ST7735_PWCTR4_APB_OFS)
#define ST7735_PWCTR4_APB_MEDIUM_HIGH (0x04 << ST7735_PWCTR4_APB_OFS)
#define ST7735_PWCTR4_APB_LARGE       (0x05 << ST7735_PWCTR4_APB_OFS)

// 2nd parameter
// DCB[7:6]: Set the booster circuit step-up cycle in idle mode/8 color
#define ST7735_PWCTR4_DCB_76_OFS  6
#define ST7735_PWCTR4_DCB_76_MASK (0x03 << ST7735_PWCTR4_DCB_76_OFS)

#define ST7735_PWCTR4_DCB_76_DIV_1   (0x00 << ST7735_PWCTR4_DCB_76_OFS)
#define ST7735_PWCTR4_DCB_76_DIV_1_5 (0x01 << ST7735_PWCTR4_DCB_76_OFS)
#define ST7735_PWCTR4_DCB_76_DIV_2   (0x02 << ST7735_PWCTR4_DCB_76_OFS)
#define ST7735_PWCTR4_DCB_76_DIV_4   (0x03 << ST7735_PWCTR4_DCB_76_OFS)

// DCB[5:4]: Set the booster circuit step-up cycle in idle mode/8 color
#define ST7735_PWCTR4_DCB_54_OFS  4
#define ST7735_PWCTR4_DCB_54_MASK (0x03 << ST7735_PWCTR4_DCB_54_OFS)

#define ST7735_PWCTR4_DCB_54_DIV_1   (0x00 << ST7735_PWCTR4_DCB_54_OFS)
#define ST7735_PWCTR4_DCB_54_DIV_1_5 (0x01 << ST7735_PWCTR4_DCB_54_OFS)
#define ST7735_PWCTR4_DCB_54_DIV_2   (0x02 << ST7735_PWCTR4_DCB_54_OFS)
#define ST7735_PWCTR4_DCB_54_DIV_4   (0x03 << ST7735_PWCTR4_DCB_54_OFS)

// DCB[3:2]: Set the booster circuit step-up cycle in idle mode/8 color
#define ST7735_PWCTR4_DCB_32_OFS  2
#define ST7735_PWCTR4_DCB_32_MASK (0x03 << ST7735_PWCTR4_DCB_32_OFS)

#define ST7735_PWCTR4_DCB_32_DIV_1   (0x00 << ST7735_PWCTR4_DCB_32_OFS)
#define ST7735_PWCTR4_DCB_32_DIV_1_5 (0x01 << ST7735_PWCTR4_DCB_32_OFS)
#define ST7735_PWCTR4_DCB_32_DIV_2   (0x02 << ST7735_PWCTR4_DCB_32_OFS)
#define ST7735_PWCTR4_DCB_32_DIV_4   (0x03 << ST7735_PWCTR4_DCB_32_OFS)

// DCB[1:0]: Set the booster circuit step-up cycle in idle mode/8 color
#define ST7735_PWCTR4_DCB_10_OFS  0
#define ST7735_PWCTR4_DCB_10_MASK (0x03 << ST7735_PWCTR4_DCB_10_OFS)

#define ST7735_PWCTR4_DCB_10_DIV_1   (0x00 << ST7735_PWCTR4_DCB_10_OFS)
#define ST7735_PWCTR4_DCB_10_DIV_1_5 (0x01 << ST7735_PWCTR4_DCB_10_OFS)
#define ST7735_PWCTR4_DCB_10_DIV_2   (0x02 << ST7735_PWCTR4_DCB_10_OFS)
#define ST7735_PWCTR4_DCB_10_DIV_4   (0x03 << ST7735_PWCTR4_DCB_10_OFS)


///////////////////////////////////////////
// PWCTR5: Power control 5 (pg. 138)
///////////////////////////////////////////
// 1st parameter
// DCC[9:8]: Set the booster circuit step-up cycle in partial mode/full color
#define ST7735_PWCTR5_DCC_98_OFS  6
#define ST7735_PWCTR5_DCC_98_MASK (0x03 << ST7735_PWCTR5_DCC_98_OFS)

#define ST7735_PWCTR5_DCC_98_DIV_1   (0x00 << ST7735_PWCTR5_DCC_98_OFS)
#define ST7735_PWCTR5_DCC_98_DIV_1_5 (0x01 << ST7735_PWCTR5_DCC_98_OFS)
#define ST7735_PWCTR5_DCC_98_DIV_2   (0x02 << ST7735_PWCTR5_DCC_98_OFS)
#define ST7735_PWCTR5_DCC_98_DIV_4   (0x03 << ST7735_PWCTR5_DCC_98_OFS)

// SAPC: Adjust the amount of fixed current from the fixed current source in the operational amplifier for the source driver.
#define ST7735_PWCTR5_SAPC_OFS  3
#define ST7735_PWCTR5_SAPC_MASK (0x07 << ST7735_PWCTR5_SAPC_OFS)

#define ST7735_PWCTR5_SAPC_STOP        (0x00 << ST7735_PWCTR5_SAPC_OFS)
#define ST7735_PWCTR5_SAPC_SMALL       (0x01 << ST7735_PWCTR5_SAPC_OFS)
#define ST7735_PWCTR5_SAPC_MEDIUM_LOW  (0x02 << ST7735_PWCTR5_SAPC_OFS)
#define ST7735_PWCTR5_SAPC_MEDIUM      (0x03 << ST7735_PWCTR5_SAPC_OFS)
#define ST7735_PWCTR5_SAPC_MEDIUM_HIGH (0x04 << ST7735_PWCTR5_SAPC_OFS)
#define ST7735_PWCTR5_SAPC_LARGE       (0x05 << ST7735_PWCTR5_SAPC_OFS)

// APC: Adjust the amount of fixed current from the fixed current source in the operational amplifier for the source driver.
#define ST7735_PWCTR5_APC_OFS  0
#define ST7735_PWCTR5_APC_MASK (0x07 << ST7735_PWCTR5_APC_OFS)

#define ST7735_PWCTR5_APC_STOP        (0x00 << ST7735_PWCTR5_APC_OFS)
#define ST7735_PWCTR5_APC_SMALL       (0x01 << ST7735_PWCTR5_APC_OFS)
#define ST7735_PWCTR5_APC_MEDIUM_LOW  (0x02 << ST7735_PWCTR5_APC_OFS)
#define ST7735_PWCTR5_APC_MEDIUM      (0x03 << ST7735_PWCTR5_APC_OFS)
#define ST7735_PWCTR5_APC_MEDIUM_HIGH (0x04 << ST7735_PWCTR5_APC_OFS)
#define ST7735_PWCTR5_APC_LARGE       (0x05 << ST7735_PWCTR5_APC_OFS)

// 2nd parameter
// DCC[7:6]: Set the booster circuit step-up cycle in partial mode/full color
#define ST7735_PWCTR5_DCC_76_OFS  6
#define ST7735_PWCTR5_DCC_76_MASK (0x03 << ST7735_PWCTR5_DCC_76_OFS)

#define ST7735_PWCTR5_DCC_76_DIV_1   (0x00 << ST7735_PWCTR5_DCC_76_OFS)
#define ST7735_PWCTR5_DCC_76_DIV_1_5 (0x01 << ST7735_PWCTR5_DCC_76_OFS)
#define ST7735_PWCTR5_DCC_76_DIV_2   (0x02 << ST7735_PWCTR5_DCC_76_OFS)
#define ST7735_PWCTR5_DCC_76_DIV_4   (0x03 << ST7735_PWCTR5_DCC_76_OFS)

// DCC[5:4]: Set the booster circuit step-up cycle in partial mode/full color
#define ST7735_PWCTR5_DCC_54_OFS  4
#define ST7735_PWCTR5_DCC_54_MASK (0x03 << ST7735_PWCTR5_DCC_54_OFS)

#define ST7735_PWCTR5_DCC_54_DIV_1   (0x00 << ST7735_PWCTR5_DCC_54_OFS)
#define ST7735_PWCTR5_DCC_54_DIV_1_5 (0x01 << ST7735_PWCTR5_DCC_54_OFS)
#define ST7735_PWCTR5_DCC_54_DIV_2   (0x02 << ST7735_PWCTR5_DCC_54_OFS)
#define ST7735_PWCTR5_DCC_54_DIV_4   (0x03 << ST7735_PWCTR5_DCC_54_OFS)

// DCC[3:2]: Set the booster circuit step-up cycle in partial mode/full color
#define ST7735_PWCTR5_DCC_32_OFS  2
#define ST7735_PWCTR5_DCC_32_MASK (0x03 << ST7735_PWCTR5_DCC_32_OFS)

#define ST7735_PWCTR5_DCC_32_DIV_1   (0x00 << ST7735_PWCTR5_DCC_32_OFS)
#define ST7735_PWCTR5_DCC_32_DIV_1_5 (0x01 << ST7735_PWCTR5_DCC_32_OFS)
#define ST7735_PWCTR5_DCC_32_DIV_2   (0x02 << ST7735_PWCTR5_DCC_32_OFS)
#define ST7735_PWCTR5_DCC_32_DIV_4   (0x03 << ST7735_PWCTR5_DCC_32_OFS)

// DCC[1:0]: Set the booster circuit step-up cycle in partial mode/full color
#define ST7735_PWCTR5_DCC_10_OFS  0
#define ST7735_PWCTR5_DCC_10_MASK (0x03 << ST7735_PWCTR5_DCC_10_OFS)

#define ST7735_PWCTR5_DCC_10_DIV_1   (0x00 << ST7735_PWCTR5_DCC_10_OFS)
#define ST7735_PWCTR5_DCC_10_DIV_1_5 (0x01 << ST7735_PWCTR5_DCC_10_OFS)
#define ST7735_PWCTR5_DCC_10_DIV_2   (0x02 << ST7735_PWCTR5_DCC_10_OFS)
#define ST7735_PWCTR5_DCC_10_DIV_4   (0x03 << ST7735_PWCTR5_DCC_10_OFS)

////////////////////////////////////
// VMCTR1: VCOM control 1 (pg. 140)
////////////////////////////////////
// 1st parameter
// VCOM voltage setting (-0.425V to -2V)
#define ST7735_VMCTR1_VCOM_OFS  0
#define ST7735_VMCTR1_VCOM_MASK (0x3F << ST7735_VMCTR1_VCOM_OFS)

#define ST7735_VMCTR1_VCOM_0_425 (0x00 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_45  (0x01 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_475 (0x02 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_5   (0x03 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_525 (0x04 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_55  (0x05 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_575 (0x06 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_6   (0x07 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_625 (0x08 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_65  (0x09 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_675 (0x0A << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_7   (0x0B << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_725 (0x0C << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_75  (0x0D << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_775 (0x0E << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_8   (0x0F << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_825 (0x10 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_85  (0x11 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_875 (0x12 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_9   (0x13 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_925 (0x14 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_95  (0x15 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_0_975 (0x16 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_0   (0x17 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_025 (0x18 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_05  (0x19 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_075 (0x1A << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_1   (0x1B << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_125 (0x1C << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_15  (0x1D << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_175 (0x1E << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_2   (0x1F << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_225 (0x20 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_25  (0x21 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_275 (0x22 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_3   (0x23 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_325 (0x24 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_35  (0x25 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_375 (0x26 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_4   (0x27 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_425 (0x28 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_45  (0x29 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_475 (0x2A << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_5   (0x2B << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_525 (0x2C << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_55  (0x2D << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_575 (0x2E << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_6   (0x2F << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_625 (0x30 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_65  (0x31 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_675 (0x32 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_7   (0x33 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_725 (0x34 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_75  (0x35 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_775 (0x36 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_8   (0x37 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_825 (0x38 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_85  (0x39 << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_875 (0x3A << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_9   (0x3B << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_925 (0x3C << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_95  (0x3D << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_1_975 (0x3E << ST7735_VMCTR1_VCOM_OFS)
#define ST7735_VMCTR1_VCOM_2_0   (0x3F << ST7735_VMCTR1_VCOM_OFS)

//////////////////////////////////////////
// VMOFCTR: VCOM offset control (pg. 142)
//////////////////////////////////////////
// NOTE: Before using this command, the bit VMF_EN of command NVFCTR1 must be set.
// 1st parameter
// Set VCOM voltage level to reduce flicker...?
// Question: Would definitions for these values be beneficial for readability?
#define ST7735_VMOFCTR_VMF_OFS  0
#define ST7735_VMOFCTR_VMF_MASK (0x1F << ST7735_VMOFCTR_VMF_OFS)

///////////////////////////////////////////////////////////////////////
// WRID2: Write ID2 value (LCD module version, saved to NVM) (pg. 143)
///////////////////////////////////////////////////////////////////////
// 1st parameter
#define ST7735_WRID2_ID2_OFS  0
#define ST7735_WRID2_ID2_MASK (0x7F << ST7735_WRID2_ID2_OFS)

//////////////////////////////////////////////////////////////////////
// WRID3: Write ID3 value (Project module ID, saved to NVM) (pg. 144)
//////////////////////////////////////////////////////////////////////
// 1st parameter
#define ST7735_WRID3_ID3_OFS  0
#define ST7735_WRID3_ID3_MASK (0xFF << ST7735_WRID2_ID3_OFS)

/////////////////////////////////////////
// NVFCTR1: NVM control status (pg. 145)
/////////////////////////////////////////
// 1st parameter
// VMF_EN: Enable use of `VMOFCTR` commands
#define ST7735_NVFCTR1_VMF_EN_OFS  6
#define ST7735_NVFCTR1_VMF_EN_MASK (0x01 << ST7735_NVFCTR1_VMF_EN_OFS)

