midimaster21b/MSP432_DriverLibrary/jedge_st7735.h
// ID2_EN: Enable use of `WRID2` command
#define ST7735_NVFCTR1_ID2_EN_OFS  5
#define ST7735_NVFCTR1_ID2_EN_MASK (0x01 << ST7735_NVFCTR1_ID2_EN_OFS)

// EXT_R: Extension command status (That's pretty vague...)
#define ST7735_NVFCTR1_EXT_R_OFS  0
#define ST7735_NVFCTR1_EXT_R_MASK (0x01 << ST7735_NVFCTR1_EXT_R_OFS)

////////////////////////////////////////
// NVFCTR2: NVM read command (pg. 146)
// Question: If everythin is specified in the datasheet, why is this a command?

// NVFCTR3: NVM write command (pg. 147)
// Command used to program/erase parts of NVM

// GMCTRP1: Gamma ('+' polarity) correction characteristics setting (pg. 148)
// See datasheet for usage

// GMCTRN1: Gamma ‘-’polarity Correction Characteristics Setting (pg. 150)
// See datasheet for usage
////////////////////////////////////////


/**********************************
 * ST7735 library functions
 **********************************/
// st7735 initialization functions
void st7735_setup(void);
void st7735_setup_pins(void);
void st7735_setup_peripherals(void);
void st7735_setup_peripherals_spi(void);
void st7735_hard_reset(void);
void st7735_configure_screen(void);
void st7735_configure_screen_power(void);
void st7735_configure_screen_display_settings(void);

// st7735 helper functions
void st7735_test(void);
void st7735_delay(uint16_t milliseconds);

// st7735 communication functions
uint8_t st7735_send_data(uint8_t data);
uint8_t st7735_send_command(uint8_t cmd);

// st7735 commands
void st7735_software_reset(void);
void st7735_sleep_out(void);
void st7735_inversion_control(uint8_t inversion_flags);
void st7735_power_control_one(uint8_t avdd, uint8_t vrhp, uint8_t vrhn, uint8_t mode);
void st7735_power_control_two(uint8_t vgh25, uint8_t vglsel, uint8_t vghbt);
void st7735_power_control_three(uint8_t sap_amplifier_current, uint8_t ap_amplifier_current, uint16_t booster_cycles);
void st7735_power_control_four(uint8_t sap_amplifier_current, uint8_t ap_amplifier_current, uint16_t booster_cycles);
void st7735_power_control_five(uint8_t sap_amplifier_current, uint8_t ap_amplifier_current, uint16_t booster_cycles);
void st7735_vcom_voltage_control(uint8_t vcom_voltage);
void st7735_inversion_off(void);
void st7735_memory_address_control(uint8_t flags);
void st7735_set_color_mode(uint8_t interface_pixel_format);
void st7735_column_address_set(uint16_t start_column, uint16_t end_column);
void st7735_row_address_set(uint16_t start_row, uint16_t end_row);
void st7735_normal_display_mode(void);
void st7735_display_on(void);
void st7735_set_positive_gamma(uint8_t *positive_gamma_corrections);
void st7735_set_negative_gamma(uint8_t *negative_gamma_corrections);
void st7735_frame_control(uint16_t frmctr_cmd, uint8_t *period, uint8_t *front_porch, uint8_t *back_porch);


#endif /* JEDGE_ST7735_H_ */
